README.org
** Encoding a Complex New Table

I set about encoding the /Death and Dismemberment/ rules for my Random Table package.

This required a few changes:

1. I needed the concept of a =current_roll=.  The /Death and Dismemberment/ table.
2. I wanted dice to be able to return strings and then use those strings as the lookup on the table’s =:data=.

I did not, at present, worry about the cumulative effects of data.  However, I’m seeing how I might do that.

Let’s dig in.

There are five tables to consider for /Death and Dismemberment/:

- Physical
- Acid/Fire
- Eldritch
- Lightning
- Non-Lethal

Here’s how I set about encoding that was as follows:

#+begin_src emacs-lisp
  (random-table/register :name "Death and Dismemberment"
    :roller #'random-table/roller/prompt-from-table-data
    :data '(("Physical" . "{Death and Dismemberment > Physical}")
	     ("Acid/Fire" . "{Death and Dismemberment > Acid/Fire}")
	     ("Eldritch" . "{Death and Dismemberment > Eldritch}")
	     ("Lightning" . "{Death and Dismemberment > Lightning}")
	     ("Non-Lethal" . "{Death and Dismemberment > Non-Lethal}")))
#+end_src

The =:roller= is a function as follows:

#+begin_src emacs-lisp
  (defun random-table/roller/prompt-from-table-data (table)
    (completing-read
     (format "%s via:" (random-table-name table))
     (random-table-data table) nil t))
#+end_src

In the case of passing the =Death and Dismemberment= table, you get the following prompt: “Death and Dismemberment via”.  And the list of options are: Physical, Acid/Fire, Eldritch, Lightning, and Non-Lethal.

Once I pick the option, I then evaluate the defined sub-table.  Let’s look at =Death and Dismemberment > Physical=.

#+begin_src emacs-lisp
  (random-table/register :name "Death and Dismemberment > Physical"
    :roller (lambda (table) (+ 1 (random 6)))
    :private t
    :data '(((1) . "Death and Dismemberment > Physical > Arm")
	     ((2) . "Death and Dismemberment > Physical > Leg")
	     ((3 . 4) . "Death and Dismemberment > Physical > Torso")
	     ((5 . 6) . "Death and Dismemberment > Physical > Head")))
#+end_src

This is a rather straight-forward table.  Let’s say the =:roller= returns a 5.  We will then evaluate the =Death and Dismemberment > Physical > Head= table; let’s look at that.  The resulting table is rather lengthy.

#+begin_src emacs-lisp
  (random-table/register :name "Death and Dismemberment > Physical > Head"
    :roller #'random-table/roller/death-and-dismemberment/damage
    :private t
    :data '(((1 . 10) . "Head Injury; Rolled {current_roll}\n- +1 Injury\n- Concussed for +{current_roll} day(s).")
	     ((11 . 15) . "Head Injury; Rolled {current_roll}\n- +1 Injury\n- Concussed for +{current_roll} day(s).\n- One Fatal Wound.\n- {Save vs. Skullcracked}")
	     ((16 . 1000) . "Head Injury; Rolled {current_roll}\n- +1 Injury\n- Concussed for +{current_roll} day(s).\n- {current_roll} - 14 Fatal Wounds.\n- {Save vs. Skullcracked}")))
#+end_src

The =:roller= (e.g. =random-table/roller/death-and-dismemberment/damage=) is as follows:

#+begin_src emacs-lisp
  (defun random-table/roller/death-and-dismemberment/damage (&rest table)
    (+ 1
       (random 12)
       (read-number "Number of Existing Injuries: " 0)
       (read-number "Lethal Damage: " 0)))
#+end_src

We roll a d12, add the number of existing injuries, and accumulated lethal damage.  Then look up the result in the =:data= of =Death and Dismemberment > Physical > Head=.  Let’s say the result is a 12.  We’ll need to roll on the the =Save vs. Skullcracked= table, which I’ve included below:

#+begin_src emacs-lisp
  (random-table/register :name "Save vs. Skullcracked"
    :roller #'random-table/roller/saving-throw
    :private t
    :data '(("Save" . "Saved against cracked skull…gain a new scar.")
	     ("Fail" . "Failed to save against cracked skull.  {Save vs. Skullcracked > Failure}")))
#+end_src

The =:roller= (e.g. =random-table/roller/saving-throw=) will prompt for the saving throw score and any modifier to the roll.  Then it will return “Fail” or “Save” depending on the results.  See the function.

#+begin_src emacs-lisp
  (defun random-table/roller/saving-throw (table)
    (let ((score (read-number (format "%s\n> Enter Saving Throw Score: " (random-table-name table)) 15))
	   (modifier (read-number (format "%s\n> Modifier: " (random-table-name table)) 0))
	   (roll (+ 1 (random 20))))
      (cond
	((= roll 1) "Fail")
	((= roll 20) "Save")
	((>= (+ roll modifier) score) "Save")
	(t "Fail"))))
#+end_src

Let’s say that we “Fail” the saving throw.  We now lookup on the =Save vs. Skullcracked > Failure= table:

#+begin_src emacs-lisp
  (random-table/register :name "Save vs. Skullcracked > Failure"
			 :private t
			 :data '("Permanently lose 1 Intelligence."
				 "Permanently lose 1 Wisdom."
				 "Permanently lose 1 Charisma."
				 "Lose your left eye. -1 to Ranged Attack."
				 "Lose your right eye. -1 to Ranged Attack."
				 "Go into a coma. You can recover from a coma by making a Con check after 1d6 days, and again after 1d6 weeks if you fail the first check. If you fail both, it is permanent."))
#+end_src

Let’s say we get “Permanently lose 1 Intelligence” for the failed save.  Now, working our way back, let’s see what that all evaluates to:

#+begin_example
Head Injury; Rolled 12
- +1 Injury
- Concussed for +12 day(s).
- One Fatal Wound.
- Failed to save against cracked skull.  Permanently lose 1 Intelligence
#+end_example

The modified d12 roll resulted in a 12; hence the +12 day(s).

** Prompting for You to Roll the dice

Let’s create a quick table:

#+begin_src emacs-lisp
  (random-table/register
     :name "Random Attribute"
     :data '("Strength"
	     "Constitution"
	     "Dexterity"
	     "Intelligence"
	     "Wisdom"
	     "Charisma"))
#+end_src

Given that I passed the universal prefix arg (e.g. =C-u=) when I roll on the =Random Attribute= table then I will get the prompt “Roll 1d6 for:” and the value I enter will be used for looking up the correct =:data= element.

In this way, you can roll the dice and use this package to encode the rules lookup.

** Exclude a Table from Prompting for a Roll

Any table that has one element in =:data= will not prompt for the roll.  Also, you can specify =:exclude-from-prompt t= when registering a table; then any “rolls” on that specific table will not prompt to give the dice value.

Ultimately, the goal is to ask for dice rolls when they might be something the player wants to roll.

** Allow for Rudimentary Math Operands with Table Results

In my quest for more random tables and functionality, I worked through Errant’s Hiring Retainers section.  Using the PC’s presence, you look-up the morale base.  Then roll 2d6, modified by the offer’s generosity, to then determine the modifier to the morale base.

To perform mathematical operations, I continue to leverage the =s-format= functionality.  That is =s-format= will evaluate and replace the text of the following format: ={text}=.

Below is the definition of a random Henchman for Errant.

#+begin_src emacs-lisp
  (random-table/register
   :name "Henchman (Errant)"
   :data '("\n- Archetype :: {Henchman > Archetype}\n- Morale :: {(Henchman > Morale Base) + (Henchman > Morale Variable)}"))
#+end_src

The ={Henchman > Archetype (Errant)}= will look on the following table:

#+begin_src emacs-lisp
    (random-table/register
     :name "Henchman > Archetype"
     :private t
     :roller #'random-table/roller/1d10
     :data '(((1 . 5) . "Warrior")
	     ((6 . 8) . "Professional")
	     ((9 . 10) . "Magic User")))
#+end_src

The ={[Henchman > Morale Base] + [Henchman > Morale Variable]}= does the following:

- Roll on =Henchman > Morale Base=
- Roll on =Henchman > Morale Variable=
- Add those two results together.  

#+begin_src emacs-lisp  
  (random-table/register
   :name "Henchman > Morale Base"
   :private t
   :roller (lambda (table) (read-number "Hiring PC's Presence Score: "))
   :data '(((3 . 4) . 5)
	   ((5 . 8) . 6)
	   ((9 . 13) . 7)
	   ((14 . 16) . 8)
	   ((17 . 18) . 9)
	   ((19 . 20) . 10)))

  (random-table/register
   :name "Henchman > Morale Variable"
   :private t
   :roller (lambda (table)
	     (let* ((options '(("Nothing" . 0) ("+25%" . 1) ("+50%" . 2) ("+75% or more" . 3)))
		    (key (completing-read "Additional Generosity of Offer: " options))
		    (modifier (alist-get key options nil nil #'string=)))
	       (+ modifier (random-table/roller/2d6 table))))
   :data '(((2) . -2)
	   ((3 . 5) . -1)
	   ((6 . 8) . 0)
	   ((9 . 11) . 1)
	   ((12 . 15) . 2)))
#+end_src

** Registering Prompts

Similar to =random-table/roller=, you can register a prompt via =random-table/prompt=.  There are common prompts (e.g. “Charisma Modifier”).  In registering a prompt, during an invocation of =random-table/roll= each prompt will only be requested once.  That is to say, the package will cache the prompt’s response and re-use that through out the roll.

This functionality leverages the per =random-table/roll= cache (as stored in the =random-table/roll/cache= variable).

#+begin_src emacs-lisp
  (random-table/prompt "Charisma Modifier"
		       :type #'read-number
		       :default 0)

  (random-table/register :name "Reaction Roll"
			 :roller (lambda (table)
				   (+ (random-table/prompt "Charisma Modifier")
				      (random-table/roller/2d6))))
#+end_src

Why include the caching?  In reviewing Kevin Crawford’s [Scarlet Heroes](https://www.drivethrurpg.com/product/127180/Scarlet-Heroes?affiliate_id=318171) there’s a table for reaction rolls that asks for a few modifiers, the rolls on one table, and one result is to roll on another table using those same modifiers.

** Testing All of This

I have added the non-interactive =random-table/roll/test-all= function; this will roll once on each of the registered non-private tables and report the results.  I've found it most useful when testing notable refactoring; namely how I handle the =:roller= slot for a =random-table=.


* The Code

#+begin_src emacs-lisp :tangle "random-table.el" :results none 
  ;;; random-table.el --- Roll on some tables. -*- lexical-binding: t -*-

  ;;; Metadata
  ;;
  ;; Copyright (C) 2023 Jeremy Friesen
  ;; Author: Jeremy Friesen <jeremy@jeremyfriesen.com>
  ;; Version: 0.6.0
  ;; Package-Requires: ((emacs "29.1"))
  ;;
  ;;; License
  ;;
  ;; This file is NOT part of GNU Emacs.
  ;;
  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.
  ;;
  ;;; Code:
#+end_src

** Primary Functions
There are four primary functions:

- =random-table/register= :: A function for naming and defining the tables.
- =random-table/roll= :: An interactive function to select a table on which to roll.
- random-table/prompt :: A function for naming and referencing different prompts.  i.e. For old school adventuring, when you roll a Reaction Roll, you want to prompt for the current “Charisma Modifier”.
- =random-table/parse= :: This parses the provided text, thus allowing for composition of multiple tables.

