random-table.el

(cl-defstruct random-table
  "The definition of a structured random table.

I roll the dice, filter the results, and fetch from the table.
The `random-table/evaluate/table' defines the steps we take to
\"roll on the table.\"

The slots are:

- :name :: the human readable and reference-able name (used for
	   completing read and the key for the table storage).
- :data :: the tabular data, often as a list of strings.  By
	   design, those list of strings can have interpolation
	   (e.g. \"${2d6}\" both of dice structures but also of
	   other tables.
- :roller :: this is what we roll, see `random-table/roll-on'
- :filter :: function to filter the list of dice.

- :fetcher :: function that takes two positional arguments (see
	      `random-table/fetcher/default'.); it is used to
	      fetch the correct entry from the table.
- :exclude-from-prompt :: when true, ignore the prefix arg for
			  prompting for dice roll. (see
			  `random-table/roller')
- :private :: when true, do not show in list of rollable tables.

- :store :: When non-nil, we store the roller's value for the
	    duration of the table evaluation.  Useful for when
	    you have one roll that you use for multiple tables.
- :reuse :: the :name of a table's stored dice results.

About :reuse and :store

There are cases where we want to use one set of dice roles.  For
example, in the \"Oracle (Black Sword Hack)\" table we roll dice
and use those dice results to determine both the answer as well
as whether there are unexpected events.  All from the same roll."
  name
  data
  (roller #'random-table/roller/default)
  ;; TODO: Filter should take a table
  (filter #'random-table/filter/default)
  ;; TODO: Fetcher should take a table
  (fetcher #'random-table/fetcher/default)
  (exclude-from-prompt nil)
  (private nil)
  (store nil)
  (reuse nil))

(cl-defun random-table/register
    (&rest kws &key name data exclude-from-prompt &allow-other-keys)
  "Store the DATA, NAME, and all given KWS in a `random-table'."
  ;; We need to guard for a reserved character; which we use for operations.
  (if (string-match-p "[{}\]\[)(/\+\-\*]" name)
      (user-error (concat "Attempt to register \"%s\" table failed.  "
			  "You cannot include the following characters:  "
			  "\"{\", \"}\", \"[\", \"]\", \"(\", \")\", \"/\", "
			  "\"*\", \"-\", \"+\".")
		  name)
    (let* ((struct (apply #'make-random-table
			  :name name
			  ;; When there's only one possible result, don't prompt
			  ;; the user when they chose the "I'll roll my own
			  ;; dice" option.
			  :exclude-from-prompt (or exclude-from-prompt
						   (= 1 (length (-list data))))
			  :data (-list data) kws)))
      (puthash name struct random-table/storage/tables))))

(defun random-table/coerce-input (text)
  "Coerce initial TEXT to wrap in \"{\" \"}\" brackets."
  (if (string-match-p "{" text) text (concat "{" text "}")))

;;;; Interactive
;;;###autoload
(defun random-table/roll (text)
  "Evaluate the given TEXT by \"rolling\" it.

This can either be a named table or a general text (e.g. 2d6).
Or a combination of multiple tables.

When you pass the universal prefix arg, you'll be prompted to
physically roll dice for the various tables.

When you pass \"2d6\" and pass the universal prefix arg, you will
not be prompted to roll \"2d6\" dice, it rolls that.  In other
words, giving dice expressions in text will not prompt you to
roll them.

We report that function via `random-table/reporter'.

With each invocation of `random-table/roll' we assign a new empty
hash table to `random-table/storage/results'."
  (interactive (list (completing-read "Expression: "
				      random-table/storage/tables
				      ;; Predicate that filters out non-private
				      ;; tables.
				      (lambda (name table &rest args)
					(not (random-table-private table))))))
  (let ((random-table/storage/results (make-hash-table :test 'equal)))
    (funcall random-table/reporter
	     text
	     (random-table/parse (random-table/coerce-input text)))))

;;;###autoload
(defun random-table/roll-region (&optional prefix)
  "Roll region or current line.

When PREFIX is given replace the marked text."
  (interactive "P")
  (let ((random-table/reporter/format-function (lambda (e r) (format "%s" r)))
	(random-table/reporter #'random-table/reporter/as-kill-and-message)
	(text (random-table/coerce-input
	       (if (region-active-p)
		  (buffer-substring-no-properties
		   (region-beginning) (region-end))
		(apply #'buffer-substring-no-properties
		       (save-excursion
			 (goto-char (point-at-bol))
			 (skip-syntax-forward " " (point-at-eol))
			 (let ((beg (point)))
			   (goto-char (point-at-eol))
			   (skip-syntax-backward " " (point-at-bol))
			   (list beg (point))))))))
	(current-prefix-arg nil))
    (let ((result (random-table/roll text)))
      (when (and prefix (region-active-p))
	  (delete-region (region-beginning) (region-end))
	  (insert result)))))

(cl-defun random-table/prompt (name &key type range default)
  "Prompt for the given NAME.

Re-use the cached prompted answer or use the
`random-table/prompt/registry' to evaluate the prompt; then cache
that result."
  (if type
      (random-table/prompt/put name
			       (let ((prompt (format "%s: " name)))
				 (cond
				  ((eq type 'bound-integer-range)
				   `(random-table/completing-read/integer-range
				     ,prompt ,range))
				  ((eq type #'read-number)
				   `(read-number ,prompt ,default))
				  ((eq type #'completing-read)
				   `(random-table/completing-read/alist
				     ,prompt ,range nil t))
				  (t (user-error
				      "Unknown type %s function for %s registry"
				      type name)))))
    (let ((value (or (random-table/storage/results/get-rolled-value name)
		     (apply (random-table/prompt/get name)))))
      (random-table/storage/results/put-rolled-value name value)
      value)))

(defvar random-table/prompt/registry
  (make-hash-table :test 'equal)
  "Stores the prompts registered by `random-table/prompt/register'.")

(defun random-table/prompt/get (name)
  (gethash name random-table/prompt/registry))

(defun random-table/prompt/put (name value)
  (puthash name value random-table/prompt/registry))
