README.org
**** Supporting Macro

The =random-table/create-text-replacer-function= macro helps ensure a consistent method interface; see [[https://takeonrules.com/2023/12/17/introducing-extensibility-with-a-macro-a-list-and-a-reducer/][Introducing Extensibility with a Macro, a List, and a Reducer]].

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (cl-defmacro random-table/create-text-replacer-function
      (docstring &key name replacer regexp)
    "Create NAME function as a text REPLACER for REGEXP.

  - NAME: A symbol naming the replacer function.
  - REPLACER: A lambda with a number of args equal to one plus the number of
	      capture regions of the REGEXP.  The first parameter is the original
	      text, the rest are the capture regions of the REGEXP.
  - REGEXP: The regular expression to test against the given text.
  - DOCSTRING: The docstring for the newly created function.

  This macro builds on the logic found in `s-format'"
    (let ((name (if (stringp name) (intern name) name)))
      `(defun ,name (text)
	 ,docstring
	 (let ((saved-match-data (match-data)))
	   (unwind-protect
	       (replace-regexp-in-string
		,regexp
		(lambda (md)
		  (let ((capture-region-text-list
			 ;; Convert the matched data results into a list, with the
			 ;; `car' being the original text and the `cdr' being a
			 ;; list of each capture region.
			 (mapcar (lambda (i) (match-string i md))
				 (number-sequence 0 (- (/ (length (match-data)) 2)
						       1))))
			(replacer-match-data (match-data)))
		    (unwind-protect
			(let ((replaced-text
			       (cond
				(t
				 (set-match-data saved-match-data)
				 (apply ,replacer capture-region-text-list)))))
			  (if replaced-text
			      (format "%s" replaced-text)
			    (signal 's-format-resolve md)))
		      (set-match-data replacer-match-data))))
		text t t)
	     (set-match-data saved-match-data))))))
#+end_src

**** Inner Table

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (random-table/create-text-replacer-function
   "Conditionally replace inner-table for TEXT.

  Examples of inner-table are:

  - \"[dog/cat/horse]\" (e.g. 3 entries)
  - \"[hello world/good-bye mama jane]\" (2 entries)

  This skips over inner tables that have one element (e.g. [one])."
   :name random-table/text-replacer-function/inner-table
   :regexp "\\[\\([^\]]+/[^\]]+\\)\\]"
   :replacer (lambda (matching-text inner-table)
	       (seq-random-elt (s-split "/" inner-table))))
#+end_src

**** Table with Math

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (random-table/create-text-replacer-function
   "Conditionally perform math operation on table results for TEXT.

  Examples of math operation:

  - \"{(Henchman > Morale Base) + (Henchman > Morale Variable)}\""
   :name random-table/text-replacer-function/table-math
   :regexp "{(\\([^)]*\\))\s*\\([\-+\*]\\)\s*(\\([^)]*\\))}"
   :replacer (lambda (matching-text left-operand operator right-operand)
	       (format "%s" (funcall
			     (intern operator)
			     (string-to-number
			      (random-table/parse
			       (string-trim left-operand)))
			     (string-to-number
			      (random-table/parse
			       (string-trim right-operand)))))))
#+end_src

**** Current Roll

Throughout the rolling sequence, we keep track of what was just rolled.

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (defvar random-table/current-roll
    nil
    "The most immediate and current stored roll.")
#+end_src

#+begin_src emacs-lisp :tangle "random-table.el" :results none
    (random-table/create-text-replacer-function
     "Conditionally replace TEXT with the current roll.

    Examples of current roll:

    - \"{ CURRENT_ROLL }\"
    - \"{CURRENT_ROLL}\"

    See `random-table/current-roll'."
     :name random-table/text-replacer-function/current-roll
     :regexp "{\\(\s*CURRENT_ROLL\s*\\)}"
     :replacer (lambda (matching-text current)
		 (or random-table/current-roll matching-text)))
	       #+end_src

**** Dice Expression

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (random-table/create-text-replacer-function
   "Conditionally replace dice-expression of TEXT.

  Examples:

  - \"{1d6}\"
  - \"{2d6 + 3}\"
  - \"{ d6+3 }\"
  "
   :name random-table/text-replacer-function/dice-expression
   :regexp "{\s*\\([1-9][[:digit:]]*d[[:digit:]]+\\)\s*\\([+-][0-9]+\\)?\s*}"
   :replacer (lambda (matching-text dice &optional modifier)
	       (format "%s" (random-table/dice/roll (concat dice modifier)))))
#+end_src

**** From Interactive Prompt

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (random-table/create-text-replacer-function
   "Conditionally replace TEXT with roll on table.

  The regexp will match the entire line and attempt a direct lookup
  on the tables; failing that it will attempt to evaluate as a dice expression

  See `random-table/dice/regex' for matching dice expressions."
   :name random-table/text-replacer-function/from-interactive-prompt
   :regexp "^\\(.+\\)$"
   :replacer (lambda (matching-text table-name)
	       (if-let ((table (random-table/fetch
				(string-trim table-name) :allow_nil t)))
		   (random-table/evaluate/table table)
		 (if (string-match-p random-table/dice/regex
				     (string-trim matching-text))
		     (random-table/dice/roll (string-trim matching-text))
		   matching-text))))
#+end_src

**** Named Table

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (random-table/create-text-replacer-function
   "Conditionally replace TEXT with roll on table.

  Examples:

  - \"{Name (d2)}\"."
   :name random-table/text-replacer-function/named-table
   :regexp "{\s*\\([^})]+\\)\s*\\((\\([^)]+\\))\\)?\s*}"
   :replacer (lambda (matching-text table-name &optional has-roller roller)
	       (if-let ((table (random-table/fetch
				(string-trim table-name) :allow_nil t)))
		   (random-table/parse
		    (random-table/evaluate/table table roller))
		 matching-text)))
#+end_src

*** Specifying Replacer Functions

The =random-table/text-replacer-functions= 

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (defcustom random-table/text-replacer-functions
    '(random-table/text-replacer-function/current-roll
      random-table/text-replacer-function/dice-expression
      random-table/text-replacer-function/from-interactive-prompt
      random-table/text-replacer-function/named-table
      random-table/text-replacer-function/inner-table
      random-table/text-replacer-function/table-math)
    "Functions take on string parameter and return a string.

  The function is responsible for finding and replacing any matches
  within the text.

  See `random-table/create-text-replacer-function' macro for
  creating one of these functions."
    :group 'random-table
    :package-version '(random-table . "0.4.0")
    :type '(list :value-type (group function)))
#+end_src

*** =random-table/parse=

The =random-table/parse= function processes the list of functions.

- =(random-table/parse "[Hello/Good-bye]")= :: pick either Hello or Good-bye.
- =(random-table/parse "{ 2d6 }")= :: roll 2 six-sided dice.

#+begin_src emacs-lisp :tangle "random-table.el" :results none
  (defun random-table/parse (text)
    "Roll the given TEXT.

  This is done by formatting the given text and passing it to each
  of the functions listed in `random-table/text-replacer-functions'."
    (let ((given-text (format "%s" text)))
      (cl-reduce (lambda (string el) (funcall el string))
		 random-table/text-replacer-functions
		 :initial-value given-text)))
#+end_src

** Supporting Variables/Functions

*** Storing Results

I want to store, for later reference, the results of rolls on a table.

#+begin_src emacs-lisp :tangle "random-table.el" :results none 
  (defvar random-table/storage/results
    (make-hash-table :test 'equal)
    "An ephemeral storage for various results of rolling.

  As part of the rolling, we both add to and remove those stored
  values; that is to say functions are responsible for clean-up.
  See `random-table' for discussion about storage and reuse.")

  (defun random-table/storage/results/put-rolled-value (name value)
    (puthash name value random-table/storage/results))

  (defun random-table/storage/results/get-rolled-value (name)
    (gethash name random-table/storage/results))
#+end_src


