README.org
*** Rolling Some Actual Dice

Ultimately, we need to roll some dice.  Actual, virtual, polyhedrals.

#+begin_src emacs-lisp :tangle "random-table.el" :results none 
(defvar random-table/dice/regex
  "^\\([0-9]*\\)?d\\([0-9]*\\)\\([+-][0-9]*\\)?")

;;; Dice String Evaluator
;;
;; The following code (with the function name prefix of \"random-table/dice\"
;; is derived from Pelle Nilsson's decide.el package
(defun random-table/dice/roll (spec-string)
  "Evaluate the given SPEC-STRING by parsing as a dice expression."
  (if (string= "d66" spec-string)
      (+ (* 10 (+ 1 (random 6))) (+ 1 (random 6)))
    (apply #'random-table/dice/roll-spec
	   (random-table/dice/parse-spec spec-string))))

(defun random-table/dice/parse-spec (spec)
  "Convert SPEC to list:

   - Number of dice
   - Face
   - Adder

  e.g. \"1d6\" -> (1 6 0) or \"2d10+2\" -> (2 10 2)"
  (when (string-match
	 "^\\([0-9]*\\)?d\\([0-9]*\\)\\([+-][0-9]*\\)?"
	 spec)
    (list (random-table/dice/string-to-number
	   (match-string 1 spec) 1)
	  (random-table/dice/string-to-number
	   (match-string 2 spec) 6)
	  (random-table/dice/string-to-number
	   (match-string 3 spec) 0))))

(defun random-table/dice/string-to-number (spec default)
  "Convert the SPEC (and DEFAULT) into an integer."
  (let ((n (if (stringp spec)
	       (string-to-number spec)
	     0)))
    (cond ((null spec) default)
	  ((> n 0) n)
	  ((string= "" spec) default)
	  ((string= "+" spec) 0)
	  ((string= "-" spec) 0)
	  (t spec))))

(defun random-table/dice/roll-spec (number-dice faces modifier)
  "Roll the NUMBER-DICE each with FACES number of sides and add MODIFIER."
  (let ((amount modifier))
    (dotimes (i number-dice)
      (setq amount (+ amount 1 (random faces))))
    amount))
#+end_src

*** Reporter

When you roll on tables, you need to output that information.  This is done via the =random-table/reporter=.

#+begin_src emacs-lisp :tangle "random-table.el" :results none 
(defcustom random-table/reporter
  #'random-table/reporter/as-kill-and-message
  "The function takes two positional parameters:

- EXPRESSION :: The text to evaluate for \"rolling\"
- RESULT :: The results of those rolls.

See `random-table/reporter/as-kill-and-message'."
  :group 'random-table
  :package-version '(random-table . "0.1.0")
  :type '(choice
	  (function-item :tag "Kill and Message"
			 random-table/reporter/as-kill-and-message)
	  (function-item :tag "Insert"
			 random-table/reporter/as-insert)))

(defvar random-table/reporter/format-function
  (lambda (expression results) (format "- %s :: %s" expression results))
  "The configured function takes two positional arguments:

- expression :: the initial text provided `random-table/roll'
- restults :: the transformed results by replacing the table declarations with
	      their rolled results.

I structure my results in an `org-mode' definition list format.")

(defun random-table/reporter/as-kill-and-message (expression results)
  "Report RESULTS of EXPRESSION as `message' and `kill'.

See `random-table/reporter'."
  (let ((text (funcall random-table/reporter/format-function
		       expression results)))
    (kill-new text)
    (message text)))

(defun random-table/reporter/as-insert (expression results &optional buffer)
  "Insert RESULTS of EXPRESSION into BUFFER.

See `random-table/reporter'."
  (with-current-buffer (or buffer (current-buffer))
    (end-of-line)
    (insert (funcall random-table/reporter/format-function
		     expression results))))
#+end_src

