random-table.el

(cl-defun random-table/fetch (value &key allow_nil)
  "Coerce the given VALUE to a registered `random-table'.

When the given VALUE cannot be found in the
`random-table/stroage/tables' registry we look to ALLOW_NIL.

When ALLOW_NIL is non-nil, we return nil when no table is found
in `random-table/stroage/tables' registry.

When ALLOW_NIL is nil we raise an `error' when no table was
found in the `random-table/stroage/tables' registry."
  (if-let ((table (cond
		   ((random-table-p value)
		    value)
		   ((stringp value)
		    (gethash value random-table/storage/tables))
		   ((integerp value)
		    nil)
		   (t
		    (error (concat "Expected %s to be a `random-table', "
				   "`symbol', `integer', or `string' got %s")
			   value
			   (type-of value))))))
      table
    (unless allow_nil
      (error "Could not find table %s; use `random-table/register'" value))))

(defvar random-table/storage/tables
  (make-hash-table :test 'equal)
  "A hash-table of random tables.

The hash key is the \"human readable\" name of the table (as a symbol).
The hash value is the contents of the table.")

(defun random-table/roll-on (table &optional roller)
  "Roll on the TABLE with the ROLLER.

When no ROLLER is specified, use `random-table-roller' to find
the configured roller.

See `random-table'."
  (if-let ((roller (or roller (random-table-roller table))))
      (cond
       ((functionp roller) (funcall roller table))
       ((stringp roller) (random-table/roller/string roller))
       ((seqp roller) (random-table/roller/seq roller))
       (_ (user-error "Unable to handle %S roller for %s table"
		      roller
		      (random-table-name table))))
    (user-error "Expected given %s to have roller; got nil"
		(random-table-name table))))

(defun random-table/roller/default (table)
  "Randomly roll on the TABLE."
  ;; Constant off by one errors are likely
  (let ((faces (length (-list (random-table-data table)))))
    (if (and current-prefix-arg
	     (not (random-table-exclude-from-prompt table)))
	(read-number (format "Roll 1d%s for %s: "
			     faces (random-table-name table)))
      (+ 1 (random faces)))))

(defun random-table/roller/string (text)
  "Interpolate given TEXT as a roller."
  (if (or (string= "d66" (string-trim text))
	  (string-match-p random-table/dice/regex text))
      (if current-prefix-arg
	  (read-number (format "Roll %s: " text))
	(string-to-number
	 (format "%s" (random-table/dice/roll (string-trim text)))))
    (random-table/parse text)))

(defun random-table/roller/seq (seq)
  "Interpolate given SEQ as a roller."
  (let ((func (car seq))
	(rolls (mapcar
		(lambda (text)
		  (let ((value (if (random-table/prompt/get text)
				   (random-table/prompt text)
				 (random-table/roller/string text))))
		    (string-to-number (format "%s" value))))
		(cdr seq))))
    (apply func rolls)))

(defun random-table/filter/default (&rest rolls)
  "Filter the given ROLLS and return an integer.

See `random-table/roller/default'."
  (cond
   ;; Allows us to have table entries that are named.
   ((stringp (car rolls)) (car rolls))
   (t (apply #'+ (-list rolls)))))

(defun random-table/fetcher/default (data &optional roll)
  "Find ROLL on the given table's DATA.

When ROLL is not given, choose a random element from the TABLE."
  (if-let ((index (if (integerp roll) roll (car roll))))
      ;; Sniff out if the first element to see if we're dealing with a table
      ;; that has ranges.
      (if (-cons-pair? (car data))
	  ;; We have a cons-pair, meaning we have multiple rolls mapping to the
	  ;; same result.
	  (cdr (seq-find
		(lambda (row)
		  (if (-cons-pair? row)
		      (let ((range (car row)))
			(cond
			 ((-cons-pair? range)
			  (and (>= index (car range)) (<= index (cdr range))))
			 ((listp range)
			  (member index range))
			 ((integerp range)
			  (= index range))
			 ((stringp range)
			  (string= index range))
			 (t
			  (error (concat "Expected `cons', `list', `string' or "
					 "`integer' got %s for row %S.")
				 (type-of range) row))))
		    (member index (car row))))
		data))
	;; Off by one errors are so very real.
	(nth (- index 1) data))
    (seq-random-elt data)))


(defun random-table/evaluate/table (table &optional roller)
  "Evaluate the random TABLE, optionally using the given ROLLER.

See `random-table' structure."
  (let ((random-table/current-roll (random-table/evaluate/table/roll table roller)))
    ;; TODO: This is wildly naive.  Perhaps the current_roll needs to be
    ;; replaced with the "${Current Roll for [My Tablename]}".  Then we can
    ;; Cache that rolled value and retrieve it.
    (random-table/evaluate/table/fetch-rolled-value table random-table/current-roll)))

(defun random-table/evaluate/table/roll (table &optional roller)
  "Roll on the TABLE, conditionally using ROLLER.

This function favors re-using and caching values.

Why cache values?  Some tables you roll one set of dice and then
use those dice to lookup on other tables."
  (let ((results
	 (or (when-let ((reuse-table-name (random-table-reuse table)))
	       (or
		(random-table/storage/results/get-rolled-value reuse-table-name)
		(random-table/roll-on (random-table/fetch reuse-table-name) roller)))
	     (random-table/roll-on table roller))))
    (when (random-table-store table)
      (random-table/storage/results/put-rolled-value
       (random-table-name table) results))
    results))

(defun random-table/evaluate/table/fetch-rolled-value (table rolled)
  "Fetch the ROLLED value from the TABLE's :data slot."
  (let* ((table (random-table/fetch table))
	 (data (random-table-data table))
	 (filtered (apply (random-table-filter table) (-list rolled)))
	 (row (apply (random-table-fetcher table) data (-list filtered))))

    (or (when row (random-table/parse row)) "")))

(defun random-table/completing-read/alist (prompt alist &rest args)
  "Like `completing-read' but PROMPT to find value in given ALIST.

ARGS are passed to `completing-read'."
  (alist-get (apply #'completing-read prompt alist args)
	     alist nil nil #'string=))

(defun random-table/completing-read/integer-range (prompt range)
  "Like `completing-read' but PROMPT to find integer value in RANGE."
  (let ((strings (mapcar #'number-to-string range)))
    (string-to-number (completing-read prompt strings nil t))))



(defun random-table/roll/test-all ()
  "A convenience function to test all of the public `random-table' entries."
  (maphash (lambda (key table)
	     (unless (random-table-private table)
	       (message "Testing %s table" key)
	       ;; The test does not call these interactively, but the methods
	       ;; assume a current-prefix-arg
	       (funcall #'random-table/roll (random-table-name table))))
	   random-table/storage/tables))

(provide 'random-table)
;;; random-table.el ends here
